In [1]:
import pandas as pd

### customer Data

In [2]:
cust_data = pd.read_csv("log_data/customer_extract.csv")
cust_data.head()

,customer_id,full_name,is_active,address,district,city,country,valid_from
0,218,VERA MCCOY,Yes,1168 Najafabad Parkway,Kabol,Kabul,Afghanistan,2006-02-14 22:04:36
1,441,MARIO CHEATHAM,Yes,1924 Shimonoseki Drive,Batna,Batna,Algeria,2006-02-14 22:04:37
2,69,JUDY GRAY,Yes,1031 Daugavpils Parkway,Béchar,Béchar,Algeria,2006-02-14 22:04:36
3,176,JUNE CARROLL,Yes,757 Rustenburg Avenue,Skikda,Skikda,Algeria,2006-02-14 22:04:36
4,320,ANTHONY SCHWAB,Yes,1892 Nabereznyje Telny Lane,Tutuila,Tafuna,American Samoa,2006-02-14 22:04:37

In [4]:
cust_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  599 non-null    int64
 1   full_name    599 non-null    object
 2   is_active    599 non-null    object
 3   address      599 non-null    object
 4   district     596 non-null    object
 5   city         599 non-null    object
 6   country      599 non-null    object
 7   valid_from   599 non-null    object
dtypes: int64(1), object(7)
memory usage: 37.6+ KB

##### cek nan value

In [5]:
cust_data.isna().sum()

customer_id    0
full_name      0
is_active      0
address        0
district       3
city           0
country        0
valid_from     0
dtype: int64

In [15]:
cust_data[cust_data.district.isna()]

,customer_id,full_name,is_active,address,district,city,country,valid_from
7,381,BOBBY BOUDREAU,Yes,1368 Maracabo Boulevard,NaN,South Hill,Anguilla,2006-02-14 22:04:37
175,26,JESSICA HALL,Yes,18 Duisburg Boulevard,NaN,Città del Vaticano,Holy See (Vatican City State),2006-02-14 22:04:36
356,513,DUANE TUBBS,Yes,962 Tama Loop,NaN,Yangor,Nauru,2006-02-14 22:04:37

customer 381

In [16]:
cust_data[cust_data["city"]=="South Hill"]

,customer_id,full_name,is_active,address,district,city,country,valid_from
7,381,BOBBY BOUDREAU,Yes,1368 Maracabo Boulevard,NaN,South Hill,Anguilla,2006-02-14 22:04:37

In [17]:
cust_data[cust_data["country"]=="Anguilla"]

,customer_id,full_name,is_active,address,district,city,country,valid_from
7,381,BOBBY BOUDREAU,Yes,1368 Maracabo Boulevard,NaN,South Hill,Anguilla,2006-02-14 22:04:37

customer 26

In [19]:
cust_data[cust_data["city"]=="Città del Vaticano"]

,customer_id,full_name,is_active,address,district,city,country,valid_from
175,26,JESSICA HALL,Yes,18 Duisburg Boulevard,NaN,Città del Vaticano,Holy See (Vatican City State),2006-02-14 22:04:36

In [20]:
cust_data[cust_data["country"]=="Holy See (Vatican City State)"]

,customer_id,full_name,is_active,address,district,city,country,valid_from
175,26,JESSICA HALL,Yes,18 Duisburg Boulevard,NaN,Città del Vaticano,Holy See (Vatican City State),2006-02-14 22:04:36

customer 513

In [21]:
cust_data[cust_data["city"]=="Yangor"]

,customer_id,full_name,is_active,address,district,city,country,valid_from
356,513,DUANE TUBBS,Yes,962 Tama Loop,NaN,Yangor,Nauru,2006-02-14 22:04:37

In [22]:
cust_data[cust_data["country"]=="Nauru"]

,customer_id,full_name,is_active,address,district,city,country,valid_from
356,513,DUANE TUBBS,Yes,962 Tama Loop,NaN,Yangor,Nauru,2006-02-14 22:04:37

##### Cek Duplicate Data

In [7]:
cust_data.duplicated().sum()

0

##### Datetime data

In [8]:
pd.to_datetime(cust_data.valid_from)

0     2006-02-14 22:04:36
1     2006-02-14 22:04:37
2     2006-02-14 22:04:36
3     2006-02-14 22:04:36
4     2006-02-14 22:04:37
              ...
594   2006-02-14 22:04:37
595   2006-02-14 22:04:36
596   2006-02-14 22:04:36
597   2006-02-14 22:04:37
598   2006-02-14 22:04:37
Name: valid_from, Length: 599, dtype: datetime64[ns]

##### Cek Konsistensi District, city, country

In [29]:
# print(cust_data.district.value_counts().sort_index().to_string())

In [30]:
# print(cust_data.city.value_counts().sort_index().to_string())

In [28]:
#print(cust_data.country.value_counts().sort_index().to_string())

##### Task customer data

- replace nan with unknown
- Parsing dates

In [31]:
replace_nan = "unknown"
cust_data.district.fillna(replace_nan, inplace=True)

In [32]:
cust_data.isna().sum()

customer_id    0
full_name      0
is_active      0
address        0
district       0
city           0
country        0
valid_from     0
dtype: int64

In [33]:
cust_data.valid_from = pd.to_datetime(cust_data.valid_from)

In [34]:
cust_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  599 non-null    int64
 1   full_name    599 non-null    object
 2   is_active    599 non-null    object
 3   address      599 non-null    object
 4   district     599 non-null    object
 5   city         599 non-null    object
 6   country      599 non-null    object
 7   valid_from   599 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 37.6+ KB

### Store Data

In [35]:
store_data = pd.read_csv("log_data/store_extract.csv")
store_data.head()

,store_id,store_address,store_district,store_city,store_country,store_manager_id,store_manager_name
0,1,47 MySakila Drive,Alberta,Lethbridge,Canada,1,Mike Hillyer
1,2,28 MySQL Boulevard,QLD,Woodridge,Australia,2,Jon Stephens

#### Staff Data

In [36]:
staff_data = pd.read_csv("log_data/staff_extract.csv")
staff_data.head()

   staff_id    staff_name  staff_store_id is_active
0         1  Mike Hillyer               1       Yes
1         2  Jon Stephens               2       Yes

#### FIlm Data

In [37]:
film_data = pd.read_csv("log_data/film_extract.csv")
film_data.head()

,title,description,release_year,language,rental_duration,rental_rate,duration,replacement_cost,rating,category
0,AMADEUS HOLY,A Emotional Display of a Pioneer And a Technic...,2006,English,6,0.99,113,20.99,PG,Action
1,AMERICAN CIRCUS,A Insightful Drama of a Girl And a Astronaut w...,2006,English,3,4.99,129,17.99,R,Action
2,ANTITRUST TOMATOES,A Fateful Yarn of a Womanizer And a Feminist w...,2006,English,5,2.99,168,11.99,NC-17,Action
3,ARK RIDGEMONT,A Beautiful Yarn of a Pioneer And a Monkey who...,2006,English,6,0.99,68,25.99,NC-17,Action
4,BAREFOOT MANCHURIAN,A Intrepid Story of a Cat And a Student who mu...,2006,English,6,2.99,129,15.99,G,Action

In [38]:
film_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   title             1000 non-null   object
 1   description       1000 non-null   object
 2   release_year      1000 non-null   int64
 3   language          1000 non-null   object
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   duration          1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   category          1000 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 78.2+ KB

##### Cek nan data

In [39]:
film_data.isna().sum()

title               0
description         0
release_year        0
language            0
rental_duration     0
rental_rate         0
duration            0
replacement_cost    0
rating              0
category            0
dtype: int64

##### Cek Duplicate

In [41]:
film_data.duplicated().sum()

0

#### Rental data

In [2]:
import pandas as pd

In [4]:
data_rental = pd.read_csv("log_data/rental_extract.csv")
data_rental

,customer_id,staff_id,store_id,film_id,rental_date,rent_duration,amount
0,431,2,1,1,2005-07-08 19:03:15,3.0,0.99
1,518,1,1,1,2005-08-02 20:13:10,9.0,3.99
2,279,1,1,1,2005-08-21 21:27:43,9.0,3.99
3,411,1,1,1,2005-05-30 20:21:07,7.0,1.99
4,170,2,1,1,2005-06-17 20:24:00,6.0,0.99
...,...,...,...,...,...,...,...
16039,215,2,2,1000,2005-05-29 03:49:03,2.0,4.99
16040,235,2,2,1000,2005-06-15 21:50:32,2.0,4.99
16041,226,2,2,1000,2005-07-12 13:24:47,8.0,9.99
16042,401,2,2,1000,2005-07-31 07:32:21,1.0,4.99
16043,541,2,2,1000,2005-08-19 03:49:28,6.0,7.99

In [11]:
data_rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16044 entries, 0 to 16043
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    16044 non-null  int64
 1   staff_id       16044 non-null  int64
 2   store_id       16044 non-null  int64
 3   film_id        16044 non-null  int64
 4   rental_date    16044 non-null  object
 5   rent_duration  15861 non-null  float64
 6   amount         16044 non-null  float64
dtypes: float64(2), int64(4), object(1)
memory usage: 877.5+ KB

In [10]:
data_rental.isna().sum()

customer_id        0
staff_id           0
store_id           0
film_id            0
rental_date        0
rent_duration    183
amount             0
dtype: int64

###### rent_duration yang kosong karena tidak dikembalikan (return_datenya kosong)

In [15]:
data_rental.duplicated().sum()

0

Rental Data Task:

- parsing dates

In [16]:
data_rental.rental_date = pd.to_datetime(data_rental.rental_date)
data_rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16044 entries, 0 to 16043
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    16044 non-null  int64
 1   staff_id       16044 non-null  int64
 2   store_id       16044 non-null  int64
 3   film_id        16044 non-null  int64
 4   rental_date    16044 non-null  datetime64[ns]
 5   rent_duration  15861 non-null  float64
 6   amount         16044 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(4)
memory usage: 877.5 KB

In [17]:
def clean_data(filename, list_task=None, list_column_to_clean=None, list_value_to_fill=None):
    
    df = read_data(filename)
    
    for i in range(len(list_task)):
    
        if task[i] == "parse_date":
            df[list_column_to_clean[i]] = pd.to_datetime(df[list_column_to_clean[i]])

        elif task[i] == "handle_nan":
            df[list_column_to_clean[i]].fillna(list_column_to_clean[i], inplace=True)
        
    return df

In [18]:
def read_data(filename):
    data = pd.read_csv(filename)
    return data